/*
	1. 주석
		1. 한줄주석 : //
		2. 여러줄주석 : 
	2. 출력 함수
		1. ☆ console.log('하고싶은 말')
			: F12개발자도구 console탬 출력되는 함수
		2. alert('하고싶은 말')
			: 알람 메시지[확인] 출력하는 함수
		3. confirm('하고싶은 말')
			: 확인 메시지[확인/취소] 출력하는 함수
		4. prompt('하고싶은 말')
			: 입력 메시지 출력하는 함수
		
	3. 데이터 자료형(형식)
		1. 문자 : ' '	혹은 " "
		2. 숫자 : 200
		3. 논리 : true 혹은 false
*/

// 1. 출력 console.log('하고싶은 말')
console.log('안녕 JS')	// 문자 입력시 ' '사용
console.log("안녕 JS2")	// 문자 입력시 " "사용
console.log(200)		// 숫자는 문자처리 x
console.log("200")		// "숫자"는 문자형식
console.log(true)		// 논리형
console.log( 20+"개" )	// '문자'+숫자 => 문자 ( + : 연결연산자)

// 2. 출력 alert('하고싶은 말')
alert('안녕 JS')
alert( 20 + 20 )		// 숫자 + 숫자 => 숫자( + : 더하기 연산자 )
alert( "20" + 20 )		// 2020 출력

// 3. 출력 confirm('하고싶은 말')
confirm('컨펌 JS')

// 4. 입력 prompt('하고싶은 말')
prompt('입력 JS')